{
  "backend/main.mo": "Actor defining storage maps, user/payment/market types, and state for crypto capital flow, subscriptions, and Telegram integration.",
  "feature_evidence.json": "Feature evidence report mapping dashboard symbol‑sync features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the role of each frontend file in the project.",
  "frontend/index.html": "Base HTML document setting metadata, fonts, PWA settings, and service worker registration.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, colors, categories, and screenshots.",
  "frontend/public/sw.js": "Service worker handling install, activate, caching logic, and network/cache strategies with automatic versioning.",
  "frontend/src/App.tsx": "Root React app setting up routing, theme provider, app shell, and lazy‑loaded pages.",
  "frontend/src/components/AdvancedAssetChart.tsx": "Renders an advanced multi-layer asset chart with RSI, open interest, confluence detection, and predictive indicators using Recharts.",
  "frontend/src/components/AggregateMarketFlow.tsx": "Empty file placeholder with no implemented logic.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, footer, and routed page content.",
  "frontend/src/components/AssetAnalysis.tsx": "Displays asset selector and detailed analysis view including advanced charting for selected symbols.",
  "frontend/src/components/AssetChart.tsx": "Renders a simpler asset chart supporting price, RSI, and open interest views across timeframes.",
  "frontend/src/components/AssetsList.tsx": "Empty file placeholder with no implemented logic.",
  "frontend/src/components/BtcMonitor.tsx": "Empty file placeholder with no implemented logic.",
  "frontend/src/components/CapitalFlowProportionalRankingTable.tsx": "Empty file placeholder with no implemented logic.",
  "frontend/src/components/CapitalFlowVisualization.tsx": "Empty file placeholder with no implemented logic.",
  "frontend/src/components/ChecklistSignalsPanel3m.tsx": "Displays 3‑minute checklist signals for a symbol using candle data and calculated indicators.",
  "frontend/src/components/DominanceDashboard.tsx": "Shows USD vs BTC dominance trends, crossovers, alerts, and strength analysis with selectable views.",
  "frontend/src/components/ErrorDisplay.tsx": "Empty file placeholder with no implemented logic.",
  "frontend/src/components/FlowReversalHistory.tsx": "Empty file placeholder with no implemented logic.",
  "frontend/src/components/FlowReversalNotification.tsx": "Empty file placeholder with no implemented logic.",
  "frontend/src/components/Footer.tsx": "Renders footer with branding and external link attribution.",
  "frontend/src/components/GlobalCapitalFlow.tsx": "Computes regional and segment capital flows from asset data and renders an animated canvas visualization of global flow dynamics.",
  "frontend/src/components/GlobalCapitalFlowVisualization.tsx": "Empty placeholder component file.",
  "frontend/src/components/GlobalFlowsMarketHours.tsx": "Empty placeholder component file.",
  "frontend/src/components/GlobalRadarAlerts.tsx": "Empty placeholder component file.",
  "frontend/src/components/Header.tsx": "Renders the application header with branding, subscription badges, and authentication controls using Internet Identity.",
  "frontend/src/components/HistoricalFlowBars.tsx": "Empty placeholder component file.",
  "frontend/src/components/IntelligentCapitalFlowDiagram.tsx": "Empty placeholder component file.",
  "frontend/src/components/IntelligentRecommendations.tsx": "Generates institutional-strength crypto recommendations by enhancing assets with setup detection and calibration, displaying sortable insights and details.",
  "frontend/src/components/MainCapitalFlowDashboard.tsx": "Empty placeholder component file.",
  "frontend/src/components/MarketHours.tsx": "Calculates global market session states relative to BRT time and renders status, timing, and progress for each region.",
  "frontend/src/components/MarketTrendMonitor.tsx": "Analyzes multi-interval candle data to detect market turns and displays status with toast alerts and trend indicators.",
  "frontend/src/components/OpportunityRecognitionPanel.tsx": "Displays ranked trading opportunities based on selected strategy modality and timeframes, with symbol selection and detailed scoring dialog.",
  "frontend/src/components/OrderBookHeatmap.tsx": "Renders a heatmap of Binance order book depth with configurable limits, intervals, and liquidity wall detection.",
  "frontend/src/components/OrderBookSymbolSelector.tsx": "Loads available symbols and provides a searchable selector for choosing an order book trading pair.",
  "frontend/src/components/PaymentConfirmationModal.tsx": "Shows a confirmation modal indicating success or failure of a payment attempt with contextual messaging and styling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Prompts authenticated users without a profile to enter basic information and saves it through subscription hooks.",
  "frontend/src/components/RouteLoading.tsx": "Simple centered loading indicator for route transitions.",
  "frontend/src/components/SearchableAssetSelector.tsx": "Provides a popover-based searchable dropdown for selecting an asset symbol with keyboard support.",
  "frontend/src/components/StablecoinFlowDashboard.tsx": "Empty placeholder component.",
  "frontend/src/components/StablecoinFlowVisualization.tsx": "Empty placeholder component.",
  "frontend/src/components/StablecoinList.tsx": "Empty placeholder component.",
  "frontend/src/components/SubscriptionModal.tsx": "Handles subscription plan selection and payment initiation via Stripe, ICP, or stablecoins, with confirmation feedback.",
  "frontend/src/components/SystemSyncStatus.tsx": "UI component that checks backend connectivity and validates data structures and functions, displaying sync status with indicators.",
  "frontend/src/components/TimeFrameSelector.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/TopAssetCard.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/UnifiedCapitalFlowDashboard.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/USDCapitalDirectionDashboard.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/USDFlowMap.tsx": "Component that calculates and logs USD flow metrics for BTC, ETH, and altcoins, displaying results on a canvas with error handling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useBinanceCandles.ts": "Hook fetching Binance futures candlestick data with interval-based caching, retries, and error handling.",
  "frontend/src/hooks/useBinanceOrderBookDepth.ts": "Hook fetching Binance order book depth with parsing, retry logic, and adaptive refetch intervals.",
  "frontend/src/hooks/useCapitalFlowProportionalRanking.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useFlowReversalAlert.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hook managing Internet Identity login, stored identity loading, and auth-client lifecycle.",
  "frontend/src/hooks/useMarketMultiIntervalCandles.ts": "Hook that fetches multi-interval Binance candle data and aggregates loading, error, and data availability states.",
  "frontend/src/hooks/useOpportunityMarketData.ts": "Hook that fetches candles and optional order book data for multiple symbols and intervals, returning a nested map structure.",
  "frontend/src/hooks/useOpportunityRecognitionRanking.ts": "Fetches market data and computes ranked opportunity scores for preset symbols using a selected strategy and timeframes.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple data-fetching utilities including Binance 24h tickers, short-interval klines, and RSI calculation with retry logic.",
  "frontend/src/hooks/useSubscription.ts": "Implements admin detection, subscription status checks, and related user profile queries using backend actors.",
  "frontend/src/hooks/useThreeMinuteCandles.ts": "Fetches 3‑minute Binance Futures candlestick data for a symbol with error handling and periodic refresh.",
  "frontend/src/hooks/useThreeMinuteTimeframe.ts": "Retrieves a 3‑minute timeframe value from the backend with fallback to a local constant.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables, themes, typography, and utility classes.",
  "frontend/src/lib/checklistSignals3m.ts": "Analyzes 3‑minute candles to generate trend, entry, stop-loss, and target signals based on EMA, swing points, and candle patterns.",
  "frontend/src/lib/formatters.ts": "Legacy numeric, currency, and percentage formatting helpers that wrap newer precision-based utilities.",
  "frontend/src/lib/institutionalCalibration.ts": "Defines the institutional calibration interface and computes weighted scores for trend, support, volume, technicals, shorts, and wick rejection, producing a composite institutional rating.",
  "frontend/src/lib/institutionalSetup.ts": "Detects eight institutional setup criteria such as liquidity, Order Blocks, FVG, and displacement, determining setup completeness and generating a narrative summary.",
  "frontend/src/lib/marketFlipDetection.ts": "Detects bull/bear regime flips using EMA20/EMA50 crossovers with confirmation and returns current regime, flip direction, and timing.",
  "frontend/src/lib/marketTurnDetection.ts": "Unifies major and micro market turn detection using EMA crossovers and candle-pattern logic, returning turn type, direction, confidence, and debug data.",
  "frontend/src/lib/opportunityScoring.ts": "Scores trading opportunities across multiple strategy modalities by checking conditions, computing indicators, and generating a narrative and score.",
  "frontend/src/lib/opportunityTimeframes.ts": "Defines available timeframe options for opportunity analysis and provides helpers to map IDs to Binance intervals.",
  "frontend/src/lib/orderBookDepthMetrics.ts": "Provides utilities to calculate order book depth metrics, cumulative depth, liquidity walls, and normalization values.",
  "frontend/src/lib/precision.ts": "Implements adaptive numeric, currency, and percentage formatting with magnitude‑based decimal precision and US locale rules.",
  "frontend/src/lib/technicalIndicators.ts": "Implements EMA calculation and candlestick pattern detection including swing points, engulfing candles, and pin bars.",
  "frontend/src/lib/timeframes.ts": "Defines the constant 3‑minute timeframe and its label.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminSettings.tsx": "Admin page for managing Stripe configuration and sending test Telegram posts, with validation and logs.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard with tabs for capital flow, opportunity recognition, market data, and checklist panels.",
  "frontend/src/pages/KnowledgeBase.tsx": "Displays educational chapters, supports search, and loads content via an actor backend.",
  "frontend/src/pages/PaymentFailure.tsx": "Shows a payment cancellation message with an option to retry.",
  "frontend/src/pages/PaymentSuccess.tsx": "Handles Stripe session verification and subscription activation, showing loading, success, or error states.",
  "frontend/src/pages/PriceAction.tsx": "Fetches Binance candle data, runs lightweight pattern analysis, and renders selectable price‑action insights per symbol and timeframe.",
  "frontend/src/types/index.ts": "Defines TypeScript interfaces for crypto assets, metrics, flows, institutional analysis, and related domain models.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and persisting URL parameters using query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, fonts, and plugins for the frontend theme.",
  "project_state.json": "Project metadata describing current architecture, features, issues, and pending feature requests."
}