{
  "backend/main.mo": "Main Motoko actor managing crypto capital flow data, user subscriptions, payment processing via Stripe, access control, blob storage, Telegram notifications, and institutional trading criteria with various state variables for market data and trending assets.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: updating dialog boxes/modals to use emerald/cyan gradient styling and removing transparent backgrounds in favor of solid dark backgrounds with accent gradients.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing components, hooks, styling, and configuration with emphasis on the emerald/amber theme, capital flow visualization, and Binance Futures USDT data sources.",
  "frontend/index.html": "HTML entry point with PWA meta tags, emerald theme color (#10b981), service worker registration script with auto-update logic, and Portuguese language configuration.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, emerald theme colors, standalone display mode, multiple icon sizes for various devices, and Portuguese localization.",
  "frontend/public/sw.js": "Service worker implementing versioned caching strategy with immediate activation, network-first for HTML/API requests, cache-first for static assets, and automatic old cache cleanup.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with lazy-loaded routes (Dashboard, PaymentSuccess, PaymentFailure, AdminSettings), dark theme provider, and toast notifications.",
  "frontend/src/components/AdvancedAssetChart.tsx": "Advanced multi-layer chart component for asset analysis with RSI, Open Interest, confluence detection, predictive intelligence, and customizable time frames (1h/4h/24h).",
  "frontend/src/components/AggregateMarketFlow.tsx": "Empty file with no content.",
  "frontend/src/components/AppShell.tsx": "Main application layout shell component that renders Header, Footer, FixedIconIndicators, and an Outlet for routed content.",
  "frontend/src/components/AssetAnalysis.tsx": "Asset analysis component with symbol selector, search functionality, and integration with AdvancedAssetChart for detailed Binance Futures USDT pair analysis.",
  "frontend/src/components/AssetChart.tsx": "Basic asset chart component supporting price, RSI, and Open Interest views with multiple time frames and custom tooltips using Recharts.",
  "frontend/src/components/AssetsList.tsx": "Empty file with no content.",
  "frontend/src/components/BtcMonitor.tsx": "Empty file with no content.",
  "frontend/src/components/CapitalFlowProportionalRankingTable.tsx": "Empty file with no content.",
  "frontend/src/components/CapitalFlowVisualization.tsx": "Empty file with no content.",
  "frontend/src/components/ChecklistSignalsPanel3m.tsx": "Displays 3-minute candle checklist signals for a given symbol, showing trend direction and step-by-step signal status (met/not-met/unknown).",
  "frontend/src/components/DominanceDashboard.tsx": "Dashboard for monitoring USD stablecoin vs Bitcoin dominance with trend detection, crossover alerts, and relative strength comparison.",
  "frontend/src/components/ErrorDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/FixedIconIndicators.tsx": "Displays fixed position floating indicators for profile setup, subscription status, and premium activation with tooltips and navigation to admin settings.",
  "frontend/src/components/FlowReversalHistory.tsx": "Empty file with no content.",
  "frontend/src/components/FlowReversalNotification.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders a footer with copyright notice and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/GlobalCapitalFlow.tsx": "Visualizes global capital flows across regions (USA, Asia, Europe, Brasil, India, Arabia, Africa) and market segments (BTC, ETH, Altcoins) with canvas-based animated flow diagram centered on USD.",
  "frontend/src/components/GlobalCapitalFlowVisualization.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalFlowsMarketHours.tsx": "Empty file with no content.",
  "frontend/src/components/GlobalRadarAlerts.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Application header with authentication controls, subscription badge display (Creator/Premium/Free), and dropdown menu for settings and logout functionality.",
  "frontend/src/components/HistoricalFlowBars.tsx": "Empty file with no content.",
  "frontend/src/components/IntelligentCapitalFlowDiagram.tsx": "Empty file with no content.",
  "frontend/src/components/IntelligentRecommendations.tsx": "Displays top 20 crypto assets ranked by institutional calibration score, showing detailed setup analysis including RSI, open interest, volume intensity, and regional capital flow indicators with expandable detail dialogs.",
  "frontend/src/components/MainCapitalFlowDashboard.tsx": "Empty file with no content.",
  "frontend/src/components/MarketHours.tsx": "Displays real-time market session status for global exchanges (NYSE, LSE, Tokyo, B3, NSE, Tadawul, JSE) in BRT timezone with progress bars showing open/pre-market/after-hours states and next change times.",
  "frontend/src/components/MarketTrendMonitor.tsx": "Monitors market trends across multiple intervals, detects unified market turns (major/micro, upward/downward), and displays the highest-confidence turn signal with toast notifications for new turns.",
  "frontend/src/components/OpportunityRecognitionPanel.tsx": "Displays a ranked table of trading opportunities using multi-strategy scoring, with filtering by trading mode (Day Trade, Swing Trade, etc.) and configurable timeframes, allowing users to select symbols and view detailed breakdowns.",
  "frontend/src/components/OrderBookHeatmap.tsx": "Renders a visual heatmap of order book depth with cumulative bid/ask volumes, liquidity wall detection, and configurable depth limits and refresh intervals.",
  "frontend/src/components/OrderBookSymbolSelector.tsx": "Wraps SearchableAssetSelector to provide a symbol picker specifically for order book views, loading available symbols from useAssetSelector hook.",
  "frontend/src/components/PaymentConfirmationModal.tsx": "Displays a modal dialog showing payment attempt results with success or failure states, styled with gradient borders and icons.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a modal prompting authenticated users without a profile to enter their name and optional email, saving the profile via useSaveCallerUserProfile hook.",
  "frontend/src/components/RouteLoading.tsx": "Simple loading spinner component displayed during route transitions.",
  "frontend/src/components/SearchableAssetSelector.tsx": "Reusable searchable dropdown component for selecting cryptocurrency symbols with keyboard navigation and filtering support.",
  "frontend/src/components/StablecoinFlowDashboard.tsx": "Empty file placeholder for stablecoin flow dashboard component.",
  "frontend/src/components/StablecoinFlowVisualization.tsx": "Empty file placeholder for stablecoin flow visualization component.",
  "frontend/src/components/StablecoinList.tsx": "Empty file placeholder for stablecoin list component.",
  "frontend/src/components/SubscriptionModal.tsx": "Modal component for subscription plan selection (weekly/lifetime) with multiple payment methods (Stripe, ICP, stablecoins), handling authentication and payment flow initiation.",
  "frontend/src/components/SystemSyncStatus.tsx": "Displays real-time system synchronization status by validating backend connection, data structure alignment, and function availability with visual indicators.",
  "frontend/src/components/TimeFrameSelector.tsx": "Empty file with no content.",
  "frontend/src/components/TopAssetCard.tsx": "Empty file with no content.",
  "frontend/src/components/TradingModeSelector.tsx": "UI component for selecting trading modes (Day Trade, Swing Trade, Scalping, Position Trading) with icons and descriptions.",
  "frontend/src/components/UnifiedCapitalFlowDashboard.tsx": "Empty file with no content.",
  "frontend/src/components/USDCapitalDirectionDashboard.tsx": "Empty file with no content.",
  "frontend/src/components/USDFlowMap.tsx": "Visualizes USD capital flow across Bitcoin, Ethereum, and altcoins using independent Binance Futures metrics, calculating inflow/outflow percentages and rendering flow directions on canvas.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useBinanceCandles.ts": "React Query hook for fetching Binance Futures candlestick data with configurable intervals (3m, 15m, 1h) and automatic refetching.",
  "frontend/src/hooks/useBinanceOrderBookDepth.ts": "React Query hook for fetching Binance Futures order book depth data (bids/asks) with configurable limit and refetch interval.",
  "frontend/src/hooks/useCapitalFlowProportionalRanking.ts": "Empty file with no content.",
  "frontend/src/hooks/useFlowReversalAlert.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMarketMultiIntervalCandles.ts": "Fetches and aggregates Binance candle data across multiple intervals (3m, 15m, 1h) for a given symbol, returning loading states and error handling for each interval.",
  "frontend/src/hooks/useOpportunityMarketData.ts": "React Query hook that fetches candle data and order book depth from Binance Futures API for multiple symbols and intervals, returning a nested map structure with 3-minute refetch intervals.",
  "frontend/src/hooks/useOpportunityRecognitionRanking.ts": "Ranks trading opportunities across 20 default Binance Futures symbols by scoring them using a specified strategy modality and timeframes, returning top N scored opportunities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching Binance Futures 24hr ticker data with retry logic, calculating RSI from short-interval klines, and managing crypto asset data with validation and error handling.",
  "frontend/src/hooks/useSubscription.ts": "Manages subscription status, admin/creator privileges with localStorage caching, and user profile queries, with creator bypass logic that grants automatic active subscription to admins.",
  "frontend/src/hooks/useThreeMinuteCandles.ts": "React Query hook that fetches 3-minute interval candle data from Binance Futures API for a given symbol with automatic 3-minute refetch intervals and rate limit handling.",
  "frontend/src/hooks/useThreeMinuteTimeframe.ts": "Fetches the 3-minute timeframe identifier from the backend actor, falling back to a local constant if the backend call fails, with infinite stale time caching.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, utility classes for glow effects, and z-index fixes for Radix UI components.",
  "frontend/src/lib/checklistSignals3m.ts": "Implements a 6-step trading checklist for 3-minute timeframes, analyzing EMA alignment, pullback detection, reversal candles, entry direction, stop loss, and target levels to generate trading signals with trend direction and price levels.",
  "frontend/src/lib/formatters.ts": "Legacy number and currency formatting utilities with U.S. abbreviations (K, M, B, T) and percentage formatting, marked deprecated in favor of precision.ts for adaptive decimal scaling.",
  "frontend/src/lib/institutionalCalibration.ts": "Advanced institutional analysis engine that calculates weighted composite scores across 6 criteria (trend, support, volume/transactions, technical indicators, short positions, wick rejections) to assess institutional trading setup quality.",
  "frontend/src/lib/institutionalSetup.ts": "Detects 8 institutional trading criteria (liquidity, manipulation, CHOCH, order blocks, FVG, mitigation, displacement, institutional targets) and calculates setup progress, status, and confluence level with narrative generation.",
  "frontend/src/lib/marketFlipDetection.ts": "Detects market regime changes (Bull/Bear/Neutral/Transition) using EMA20/EMA50 crossovers with configurable confirmation periods, tracking flip direction and timestamps on closed candles.",
  "frontend/src/lib/marketTurnDetection.ts": "Detects major market regime reversals using EMA20/EMA50 crossovers and micro-turns using exhaustion patterns, swing structure breaks, and reversal candles (engulfing, hammer, shooting star).",
  "frontend/src/lib/opportunityScoring.ts": "Scoring engine for multi-strategy opportunity recognition across 15 modalities (scalping, day trade, swing, trend, reversal, liquidity, volume, institutional) with condition checks and narrative generation.",
  "frontend/src/lib/opportunityTimeframes.ts": "Defines timeframe options (3m, 15m, 1h) with Binance interval mappings and helper functions for timeframe selection and conversion.",
  "frontend/src/lib/orderBookDepthMetrics.ts": "Calculates order book depth metrics (spread, imbalance, cumulative depth), detects liquidity walls, and provides normalization utilities for bid/ask visualization.",
  "frontend/src/lib/precision.ts": "Adaptive precision formatting utilities for crypto assets supporting up to 8 decimals with magnitude-based scaling, U.S. number formatting, and currency/percentage formatting with abbreviations.",
  "frontend/src/lib/technicalIndicators.ts": "Technical indicator utilities including EMA calculation, swing high/low detection, engulfing candle patterns, and pin bar (hammer/shooting star) identification.",
  "frontend/src/lib/timeframes.ts": "Single source of truth defining the 3-minute timeframe constant and type for consistent usage across the application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminSettings.tsx": "Admin settings page for configuring Stripe payment integration (secret key, allowed countries) and testing Telegram bot posts with configuration validation and post log display.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with four tabs (Capital Flow, Opportunity Recognition, Market, Checklist) displaying various trading panels and a 3-minute timeframe indicator. Uses lazy loading for heavy components like USDFlowMap and manages symbol selection across panels.",
  "frontend/src/pages/KnowledgeBase.tsx": "Knowledge base page that displays educational trading content organized by chapters with search functionality. Fetches chapter list and content from backend actor, allows keyword search across all chapters, and renders markdown-style content.",
  "frontend/src/pages/PaymentFailure.tsx": "Simple payment failure page displaying a cancellation message with an XCircle icon and a button to retry payment. Provides user feedback when Stripe payment is cancelled or fails.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page that verifies Stripe session status and activates subscription after successful payment. Handles processing states, errors, and redirects users after confirming payment completion.",
  "frontend/src/pages/PriceAction.tsx": "Price action analysis page that fetches candlestick data from Binance API and performs pattern detection (engulfing, doji, hammer, etc.). Displays analysis results with confidence scores, trend direction, and pattern markers on a visual chart.",
  "frontend/src/types/index.ts": "TypeScript type definitions for the entire application including crypto assets, flow metrics, institutional setups, RSI data, confluence targets, and various trading indicators. Defines core data structures used across components for market analysis and trading signals.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme with HSL variables, container settings, animations, custom shadows including glow effects, and typography plugin.",
  "project_state.json": "Project state file tracking feature requests to update dialog boxes and modals with bold technological styling using emerald/cyan gradients and solid dark backgrounds instead of transparent ones."
}